from CompoundSplitter import CompoundWordSplitter


if __name__ == "__main__":

    lexicon = {
    "അവന്", "അവള്", "അവര്", "അല്ല", "ഇല്ല", "ആന", "അമ്മ", "അച്ഛന്", 
    "കുട്ടി", "വീട്", "പുസ്തകം", "മരം", "പൂവ്", "പച്ച", "പടി", "പനി", 
    "പൂന്തോട്ടം", "പക്ഷി", "മണ്ണ്", "വഴി", "പാടം", "ആകാശം", "സമുദ്രം", 
    "പുഴ", "കാമുകന്", "ജീവന്", "ഭാഷ", "അവര്‍", "കാലം", "വീട്", "കാര്", 
    "വണ്ടി", "പന", "പാഠം", "ചെറുക", "ആരും", "അവളുടെ", "നദി", "പക്ഷെ", 
    "ഓടി", "നടന്നു", "വീണ്ടും", "കാടില്", "വലുത്", "ചെറുത്"
    }

    test = ['അവളുടെയടുത്ത്' , 'മധുവിനെ' , 'സീതയുടെ' , 'അഭിമുഖീകരിക്കുമ്പോൾ' , 'ഇതിഹാസത്തിൽ' , 'മരത്തിൽ' , 'നടന്നുവന്നു' , 'പുഴയോരത്ത്']

    splitter = CompoundWordSplitter(lexicon)

    with open('output.txt' , 'w' , encoding = 'utf-8') as f:
        for word in test:
            result = splitter.split(word)
            f.write(word + "\t=\t")
            f.write(" + ".join(result))
            f.write("\n")
